"use strict";

Object.defineProperty(exports, "__esModule", {
  value: true
});
exports.default = void 0;
var _default = {
  /*
    General
  */
  title: "Haircode",
  account: {
    login: "تسجيل الدخول",
    register: "التسجيل",
    email: "الإيميل",
    phone: "الهاتف",
    create: "إنشاء",
    account: "حساب",
    my_account: "حسابي",
    password: "كلمة المرور",
    verification: "التحقق",
    code: "رمز",
    verification_code: "رمز التحقق"
  },
  dir: {
    next: "التالي",
    prev: "السابق",
    up: "أعلى",
    down: "أسفل",
    left: "يسار",
    right: "يمين",
    toward: "للأمام",
    backward: "للخلف"
  },
  langs: {
    langs: "اللغات",
    ar: "العربية",
    en: "الإنجليزية"
  },
  themes: {
    themes: "السمات",
    light: "النهار",
    dark: "الليل"
  },
  or: "أو",
  close: "إغلاق",
  dataIterator: {
    pageText: "{0}-{1} من {2}",
    noResultsText: "لا توجد سجلات مطابقة",
    loadingText: "تحميل العناصر ..."
  },
  dataTable: {
    itemsPerPageText: "الصفوف لكل صفحة:",
    ariaLabel: {
      sortDescending: ": ترتيب تنازلي . إضغط لإلغاء الترتيب.",
      sortAscending: ": ترتيب تصاعدي . إضغط للترتيب التنازلي.",
      sortNone: ": غير مرتب . إضغط للترتيب التصاعدي."
    },
    sortBy: "ترتيب حسب"
  },
  dataFooter: {
    itemsPerPageText: "العناصر لكل صفحة:",
    itemsPerPageAll: "الكل",
    nextPage: "الصفحة التالية",
    prevPage: "الصفحة السابقة",
    firstPage: "الصفحة الأولى",
    lastPage: "الصفحة الأخيرة",
    pageText: "{0}-{1} من أصل {2}"
  },
  datePicker: {
    itemsSelected: "{0} المحدد"
  },
  noDataText: "لا توجد بيانات متاحة",
  carousel: {
    prev: "الصورة السابقة",
    next: "البصري التالي"
  },
  calendar: {
    moreEvents: "{0} أكثر من"
  },
  fileInput: {
    counter: "{0} ملفات",
    counterSize: "{0} ملفات ({1} في الإجمالي)"
  },
  /*
    Global Sections
  */
  // 1. Top app bar
  topbar: {},
  // 2. Side app bar
  sidebar: {},
  // 3. Footer
  footer: {},
  /*
    Pages
  */
  // 1. Home
  home: {
    out: {},
    in: {}
  },
  // 2. Gallery
  gallery: {},
  // 3. Privacy Policy
  privacy_policy: {
    "1": "جمع معلومات محددة:",
    "2": `نقوم بجمع معلومات منك عندما تقوم بالتسجيل على موقعنا أو تقوم بحجز
          طبيب أو الاشتراك في النشرة الإخبارية لدينا. عند الحجز أو التسجيل على
          موقعنا ، حسب الاقتضاء ، قد يُطلب منك إدخال اسمك ، بريدك الإلكتروني
          العنوان ، العنوان البريدي أو رقم الهاتف.`,
    "3": "الإفصاح المتعلق بإعلانات Google الإعلانية:",
    "4": `نحن نطبق ميزات Google Analytics التي تستخدم الإعلانات المصوّرة
          معلومات عن تحليلات Google Analytics وتقارير الفائدة.
          يمكنك إلغاء الاشتراك في Google Analytics للإعلانات المصوّرة لمنع ذلك
          يتم استخدام بياناتك بواسطة Google Analytics ، من خلال الانتقال إلى Google
          صفحة إلغاء الاشتراك في Analytics. (إليك الرابط:
          <a target = "_ blank" href = "https://tools.google.com/dlpage/gaoptout/"
          > https://tools.google.com/dlpage/gaoptout/ </ أ
          >
          نحن ، مع موردي الطرف الثالث (بما في ذلك جوجل) ، نستخدم الطرف الأول
          ملفات تعريف الارتباط (مثل ملفات تعريف الارتباط في Google Analytics) وملفات تعريف الارتباط للجهات الخارجية
          (مثل ملفات تعريف الارتباط من DoubleClick) للإبلاغ عن كيفية ظهور إعلانك ،
          الاستخدامات الأخرى للخدمات الإعلانية ، والتفاعلات مع مرات ظهور الإعلان هذه
          والخدمات الإعلانية مرتبطة بزيارات إلى موقعنا. يمكنك قراءة المزيد
          حول ملفات تعريف الارتباط التي تستخدمها ميزات الإعلان في Google Analytics ، بواسطة
          الذهاب إلى صفحة سياسة خصوصية Google Analytics. (إليك الرابط:
          <ل
          أ href = "https://support.google.com/analytics/answer/2700409؟hl=en"
          الهدف = "_ فارغة"
          > https://support.google.com/analytics/answer/2700409؟hl=en </ أ
          >) `,
    "5": "استخدامات محددة للمعلومات",
    "6": `يجوز استخدام أي من المعلومات التي نجمعها منك في أحد
          الطرق التالية: لتخصيص تجربتك (معلوماتك تساعد
          لنا أن نستجيب بشكل أفضل لاحتياجاتك الفردية) لمعالجة
          المعاملات (معلوماتك ، سواء كانت عامة أو خاصة ، لن تكون
          بيعها أو تبادلها أو نقلها أو منحها لأي شركة أخرى لأي
          سبب على الإطلاق ، دون موافقتك ، بخلاف التعبير عن
          الغرض من تسليم المنتج أو الخدمة المشتراة المطلوبة). إلى
          إرسال رسائل البريد الإلكتروني الدورية (عنوان البريد الإلكتروني الذي تقدمه للحجز ، قد يكون
          تستخدم لإرسال المعلومات والتحديثات المتعلقة بحجزك ، في
          بالإضافة إلى تلقي أخبار الشركة في بعض الأحيان ، تحديثات ، المنتجات ذات الصلة
          أو معلومات الخدمة ، إلخ.) ملاحظة: إذا كنت ترغب في أي وقت
          إلغاء الاشتراك من تلقي رسائل البريد الإلكتروني في المستقبل ، ونحن تشمل مفصل
          تعليمات إلغاء الاشتراك في أسفل كل بريد إلكتروني.`,
    "7": "حماية معلوماتك",
    "8": `نحن ننفذ مجموعة متنوعة من التدابير الأمنية للحفاظ على سلامة
          معلوماتك الشخصية عندما تضع حجزًا أو تدخل ، أو ترسل ، أو
          الوصول إلى المعلومات الشخصية الخاصة بك. نحن نقدم استخدام خادم آمن.
          يتم نقل جميع المعلومات الحساسة / الائتمان المقدمة عبر الآمنة
          تقنية طبقة المقبس (SSL) ثم تشفيرها في الدفع الخاص بنا
          قاعدة بيانات موفري العبّارة فقط للوصول إليها بواسطة المخولين بذلك
          مع حقوق الوصول الخاصة إلى هذه النظم ، ويلزم للحفاظ على
          معلومات سرية. بعد الصفقة ، معلوماتك الخاصة
          (بطاقات الائتمان وأرقام الضمان الاجتماعي ، والمالية ، وما إلى ذلك) لن يكون
          المخزنة على خوادمنا.`,
    "9": "سياسة استخدام ملف تعريف الارتباط",
    "10": `ملفات تعريف الارتباط هي ملفات صغيرة ينقلها الموقع أو مزود الخدمة الخاص به
          القرص الصلب لجهاز الكمبيوتر الخاص بك من خلال متصفح الويب الخاص بك (إذا سمحت) بذلك
          تمكن المواقع أو أنظمة مزودي الخدمة من التعرف على متصفحك
          والتقاط وتذكر بعض المعلومات إذا كنت تفضل ، يمكنك
          اختر أن يكون جهاز الكمبيوتر الخاص بك يحذرك في كل مرة يتم فيها إرسال ملف تعريف الارتباط ،
          أو يمكنك اختيار إيقاف تشغيل جميع ملفات تعريف الارتباط عبر إعدادات المتصفح.
          مثل معظم مواقع الويب ، إذا قمت بإيقاف تشغيل ملفات تعريف الارتباط الخاصة بك ، بعض خدماتنا
          قد لا تعمل بشكل صحيح`,
    "11": "عدم الكشف عن المعلومات لأطراف أخرى",
    "12": `نحن لا نبيع أو نتاجر أو ننقل بطريقة أخرى إلى جهات خارجية
          معلومات التعرف الشخصية. هذا لا يشمل الوثوق الثالث
          الأطراف التي تساعدنا في تشغيل موقعنا ، وإدارة أعمالنا ،
          أو تقديم الخدمات لك ، طالما وافقت تلك الأطراف على الحفاظ على هذا
          معلومات سرية. قد نقوم أيضًا بنشر معلوماتك عندما نكون
          نعتقد أن الإفراج مناسب للامتثال للقانون ، وفرض موقعنا
          السياسات ، أو حماية حقوقنا أو غيرها من حقوق الملكية أو السلامة.
          ومع ذلك ، قد يتم تقديم معلومات الزائر غير المحددة للهوية الشخصية
          إلى أطراف أخرى للتسويق أو الإعلان أو استخدامات أخرى. الكل
          تفاصيل بطاقات الائتمان / الخصم والهوية الشخصية`,
    "21": "",
    "22": "",
    "23": "",
    "24": "",
    "25": "",
    "26": "",
    "27": "",
    "28": "",
    "29": "",
    "30": ""
  },
  /**
    Errors
  */
  errors: {
    "1": "فيه مشكلة في الشبكة, اعمل إعادة تحميل للصفحة وجرب تاني.",
    "2": "<b>فيه خطأ ما حصل</b>, من فضلك اعمل إعادة تحميل للصفحة وجرب تاني",
    "3":
      "لو فيه مشكلة بتواجهك, كلمني على الرقم <a href='tel:+201113429944'>+201113429944</a>",
    "4": "<b>الكود غلط</b>, من فضلك تحقق من كتابة الكود صحيح.",
    "5":
      "<b>انتهت صلاحية الكود</b>. انت تقدر تجرب الكود مرتين بس. من فضلك اعمل إعادة تحميل للصفحة وجرب تاني.",
    "6":
      "<b>انتهت صلاحية الريكابتشا</b>. من فضلك اعمل إعادة تحميل للصفحة وجرب تاني.",
    "7": "الإسم مينفعش يكون أقل من 4 حروف",
    "8": "فيه حقول مينفعش تسيبها فاضية.",
    "9": "الكومنت مينفعش يكون فاضي.",
    "10":
      "فيه مشكلة في إضافة المريض ده, من فضلك اعمل إعادة تحميل للصفحة وجرب مرة تاني.",
    "11": "الإسم والنوع مطلوبين.",
    "12": "الحقل المخصص اللي بتحاول تمسحه ده, ممسوح بالفعل.",
    "13": "من فضلك املئ الحقول المطلوبة",
    "14":
      "فيه مشكلة في الإنترنت حصلت أثناء التحقق من المستخدم ده, من فضلك اعمل إعادة تحميل للصفحة وجرب تاني.",
    "15":
      "<b>حضرتك طلبت عدد أكواد كتير في دقائق قليلة</b>: الهوست عمل بلوك للجهاز ده من تسجيل الدخول لمدة بضع ساعات لإن مش مضمون اللي بيحاول يسجل الدخول ده هو صاحب التطبيق ولا حد بيحاول يخترقه . من فضلك المرة الجاية انتظر الكود يوصلك حتى لو تأخر دقائق.",
    "16":
      "<b>خطأ</b>: فيه مشكلة في الإنترنت حصلت, من فضلك اعمل إعادة تحميل وجرب تاني.",
    "17": "<b>الدخول مرفوض:</b> رقم التليفون ده مش مسموح ليه يدخل التطبيق.",
    "18": "<b>رقم التليفون مش مظبوط:</b> غالباً ده مش رقم تليفون مصري.",
    "19":
      "<b>فيه مشكلة في تحميل الريكابتشا</b>, هل حضرتك متصل بالإنترنت؟ من فضلك اعمل إعادة تحميل للصفحة وجرب تاني.",
    "20":
      "<b>الريكابتشا متحلتش صح</b>, من فضلك حل الريكابتشا الأول قبل تسجيل الدخول.",
    "21":
      "<b>فيه مشكلة في الإنترنت</b>, من فضلك اعمل إعادة تحميل للصفحة وجرب تاني, أو تحقق من اتصالك بالإنترنت.",
    "22": "حضرتك حاولت بدون قصد توصل لداتا مش مسموح الوصول ليها.",
    "23":
      "الصورة اللي بتحاول تعرضها التطبيق مش قادر يوصلها. من فضلك تحقق من اتصالك بالإنترنت",
    "24": "حضرتك حاولت بدون قصد توصل لداتا مش مسموح الوصول ليها.",
    "25": "<b>خطأ أثناء تسجيل الدخول: </b>لازم تكتب كود.",
    "26": "الكود ده مش موجود",
    "27": "أنت بحاجة لاختيار نوع السؤال",
    "28": "",
    "29": "",
    "30": "",
    "31": "",
    "32": "",
    "33": "",
    "34": "",
    "35": ""
  }
};
exports.default = _default;
// export default _default;
